{
  "format": "layers-model",
  "generatedBy": "keras v2.2.4-tf",
  "convertedBy": "TensorFlow.js Converter v1.5.2",
  "modelTopology": {
    "keras_version": "2.2.4-tf",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Model",
      "config": {
        "name": "encoder",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [
                null,
                784
              ],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "encoder_input"
            },
            "name": "encoder_input",
            "inbound_nodes": []
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense",
              "trainable": true,
              "dtype": "float32",
              "units": 512,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "dense",
            "inbound_nodes": [
              [
                [
                  "encoder_input",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_1",
              "trainable": true,
              "dtype": "float32",
              "units": 512,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "dense_1",
            "inbound_nodes": [
              [
                [
                  "dense",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_2",
              "trainable": true,
              "dtype": "float32",
              "units": 512,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "dense_2",
            "inbound_nodes": [
              [
                [
                  "dense_1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "z_mean",
              "trainable": true,
              "dtype": "float32",
              "units": 128,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "z_mean",
            "inbound_nodes": [
              [
                [
                  "dense_2",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "z_log_var",
              "trainable": true,
              "dtype": "float32",
              "units": 128,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "z_log_var",
            "inbound_nodes": [
              [
                [
                  "dense_2",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [
                null,
                10
              ],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "number_input"
            },
            "name": "number_input",
            "inbound_nodes": []
          },
          {
            "class_name": "Concatenate",
            "config": {
              "name": "concatenate",
              "trainable": true,
              "dtype": "float32",
              "axis": -1
            },
            "name": "concatenate",
            "inbound_nodes": [
              [
                [
                  "z_mean",
                  0,
                  0,
                  {}
                ],
                [
                  "number_input",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          }
        ],
        "input_layers": [
          [
            "encoder_input",
            0,
            0
          ],
          [
            "number_input",
            0,
            0
          ]
        ],
        "output_layers": [
          [
            "z_mean",
            0,
            0
          ],
          [
            "z_log_var",
            0,
            0
          ],
          [
            "concatenate",
            0,
            0
          ]
        ]
      }
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of2.bin",
        "group1-shard2of2.bin"
      ],
      "weights": [
        {
          "name": "dense/kernel",
          "shape": [
            784,
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "dense/bias",
          "shape": [
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_1/kernel",
          "shape": [
            512,
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_1/bias",
          "shape": [
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_2/kernel",
          "shape": [
            512,
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_2/bias",
          "shape": [
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "z_log_var/kernel",
          "shape": [
            512,
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "z_log_var/bias",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "z_mean/kernel",
          "shape": [
            512,
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "z_mean/bias",
          "shape": [
            128
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}